Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] is tainted, so must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ arn                      = "arn:aws:eks:ap-southeast-1:010352592457:addon/thodung-vntechies-eks-demo-eks/aws-ebs-csi-driver/9ec4ac44-da83-8062-82fc-621f024527bd" -> (known after apply)
      + configuration_values     = (known after apply)
      ~ created_at               = "2023-07-15T07:52:47Z" -> (known after apply)
      ~ id                       = "thodung-vntechies-eks-demo-eks:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at              = "2023-07-15T07:59:43Z" -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - groups:
                  - system:bootstrappers
                  - system:nodes
                  rolearn: arn:aws:iam::010352592457:role/eks-node-group-thodung-vntechies-demo-eks
                  username: system:node:{{EC2PrivateDNSName}}
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`